spec/cassettes/Create_payment_on_successful_charge/creates_a_payment_with_webhood_from_stripe_for_charge_succeed.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_15yYzgLCTUylKIRln74HkdCq
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.20.4
      Authorization:
      - Bearer sk_test_yNosIrCvrAuVttjO60dxy7zy
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.20.4","lang":"ruby","lang_version":"2.1.5 p273 (2014-11-13)","platform":"x86_64-darwin14.0","publisher":"stripe","uname":"Darwin
        TomodeMacBook-Air.local 14.3.0 Darwin Kernel Version 14.3.0: Mon Mar 23 11:59:05
        PDT 2015; root:xnu-2782.20.48~5/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 04 May 2015 02:36:30 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1913'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_8dYy4MjhAoSfJd1j
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_15yYzgLCTUylKIRln74HkdCq",
          "created": 1430705260,
          "livemode": false,
          "type": "charge.succeeded",
          "data": {
            "object": {
              "id": "ch_15yYzgLCTUylKIRlP66CKpX5",
              "object": "charge",
              "created": 1430705260,
              "livemode": false,
              "paid": true,
              "status": "succeeded",
              "amount": 99,
              "currency": "usd",
              "refunded": false,
              "source": {
                "id": "card_15yYzeLCTUylKIRll7zhkfMs",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 5,
                "exp_year": 2015,
                "fingerprint": "Z2GkECNfVSpQKiE3",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "dynamic_last4": null,
                "metadata": {},
                "customer": "cus_6Aupm1THLvHTnO"
              },
              "captured": true,
              "balance_transaction": "txn_15yYzgLCTUylKIRluBT7Obmz",
              "failure_message": null,
              "failure_code": null,
              "amount_refunded": 0,
              "customer": "cus_6Aupm1THLvHTnO",
              "invoice": "in_15yYzgLCTUylKIRlcnjWhIBb",
              "description": null,
              "dispute": null,
              "metadata": {},
              "statement_descriptor": null,
              "fraud_details": {},
              "receipt_email": null,
              "receipt_number": null,
              "shipping": null,
              "application_fee": null,
              "refunds": {
                "object": "list",
                "total_count": 0,
                "has_more": false,
                "url": "/v1/charges/ch_15yYzgLCTUylKIRlP66CKpX5/refunds",
                "data": []
              }
            }
          },
          "object": "event",
          "pending_webhooks": 0,
          "request": "iar_6AupyN8zrE6fF4",
          "api_version": "2015-04-07"
        }
    http_version: 
  recorded_at: Mon, 04 May 2015 02:36:30 GMT
recorded_with: VCR 2.9.3
